{
  "navbar": {
    "about": "O MNIE",
    "portfolio": "PORTFOLIO",
    "skills": "UMIEJĘTNOŚCI",
    "contact": "KONTAKT"
  },

  "about": {
    "name": "Mam na imię",
    "title": "wszystkie swoje realizacje opieram na solidnych fundamentach.",
    "button1": "Moje projekty",
    "button2": "Moje umiejętności",
    "button3": "Kontakt",
    "text1": "Z wykształcenia jestem inżynierką budownictwa oraz trenerką pływania II klasy. Dotychczas pracowałam w firmie budowlanej, w szkole pływania oraz udzielałam korepetycji. Mimo wielu talentów dopiero programowanie uświadomiło mi, że chcę się nim zajmować na co dzień.",
    "text2": "Jeżeli poszukują Państwo osoby w pełni gotowej do działania oraz dalszej nauki z przyjemnością dołączę do zespołu aby czerpać wiedzę od specjalistów i z chęcią wykonywać powierzone mi zadania.",
    "download": "Pobierz moje CV."
  },

  "projects": {
    "projects": "Moje projekty",
    "website": "Strona internetowa",
    "kindergarten": "Przedszkole Planeta Dziecka",
    "dentistry": "Stomatologia Zębuszka",
    "shop": "Sklep Miodzio",
    "kindergarten2": "Przedszkole Planeta Dziecka",
    "accounts": "KsięgowośćIT.pl",
    "portfolio": "Moje portfolio",
    "youmoney": "YouMoney",
    "forClient": "projekt dla klienta",
    "forPractice": "projekt dla praktyki"
  },

  "skills": {
    "skills": "Moje umiejętności",
    "questions": "Najczęściej zadawane pytania",
    "question1": "Dlaczego wybrałam frontend?",
    "question2": "W jakiej technologii czuję się najlepiej?",
    "question3": "W jakiej technologii chcę docelowo pracować? ",
    "question4": "Jakie technologie chcę jeszcze poznać? ",
    "question5": "W jaki sposób zdobywam wiedzę w zakresie IT? ",
    "answer1": "Wybór front-endu jako mojej ścieżki w programowaniu wynika z kilku ważnych powodów. Przede wszystkim, zdecydowałam się rozpocząć przygodę z programowaniem, ponieważ nie chcę ograniczać się do wykonywania tych samych zadań, ale raczej stale się rozwijać i podejmować nowe wyzwania. Front-end daje mi możliwość ciągłego uczenia się i wykorzystywania nowych technologii oraz narzędzi w projektach, co bardzo mnie motywuje. Ponadto, podczas eksploracji różnych ścieżek w IT, doszłam do wniosku, że chciałabym być odpowiedzialna za to, co użytkownik widzi i doświadcza. Front-end daje mi możliwość bezpośredniego wpływu na interakcje użytkowników z aplikacjami internetowymi oraz ich doświadczenia. To stanowisko pozwala mi przekształcać projekty graficzne w działające, interaktywne interfejsy, co sprawia mi ogromną przyjemność. W skrócie, wybór front-endu jako mojej dziedziny skupienia w IT wynika z mojego pragnienia ciągłego rozwoju, chęci podejmowania nowych wyzwań oraz satysfakcji płynącej z tworzenia użytkownikom przyjaznych aplikacji internetowych.",
    "answer2": "W obszarze tworzenia stron internetowych czy aplikacji, moja największa pewność i komfort znajdują się przy wykorzystaniu biblioteki React.js, w połączeniu z językiem JavaScript oraz językiem CSS. Dzięki React.js mam możliwość efektywnego tworzenia dynamicznych i interaktywnych interfejsów, podczas gdy znajomość JavaScriptu i CSS pozwala mi precyzyjnie kontrolować wygląd i zachowanie stron. ",
    "answer3": "Na daną chwilę docelowa technologia, w której chciałbym pracować, to React. Uważam, że React jest niezwykle potężnym narzędziem do budowania dynamicznych i responsywnych interfejsów użytkownika. Chciałbym kontunuować zgłębianie Reacta, aby stać się ekspertem w tej dziedzinie.",
    "answer4": "W najbliższej przyszłości chciałbym zgłębić framework Angular oraz Vue.js, ponieważ uważam, że posiadają one ogromny potencjał i są bardzo popularne w branży. Ponadto, planuję zdobyć także wiedzę na temat języka GraphQL, który zyskuje coraz większą popularność jako alternatywa w obszarze zapytań API. Wierzę, że zdobycie umiejętności w tych technologiach pozwoli mi tworzyć jeszcze bardziej zaawansowane i innowacyjne aplikacje, spełniając tym samym wymagania rynku.",
    "answer5": "Wiedzę w dziedzinie IT zdobywam poprzez różnorodne źródła. Regularnie uczę się nowych technologii i narzędzi poprzez kursy online oraz czytanie dokumentacji, korzystam również z takich źródeł jak youtube czy chatGPT. Natomiast praktyczne projekty odgrywają kluczową rolę w moim procesie nauki, ponieważ pozwalają mi utrwalać zdobytą wiedzę."
  },


  "contact": {
    "contact": "Skontaktuj się ze mną",
    "map": "Warszawa",
    "message": "Napisz do mnie",
    "placeholder1": "Imię lub nazwa firmy",
    "placeholder2": "Numer telefonu",
    "placeholder3": "Email",
    "placeholder4": "Napisz wiadomość...",
    "placeholder1Error": "Pole \"Imię lub nazwa firmy\" nie może pozostać puste.",
    "placeholder2Error": "Pole \"numer telefonu\" nie może pozostać puste.",
    "placeholder3Error": "Pole \"adres email\" nie może pozostać puste.",
    "placeholder4Error": "Pole \"Napisz wiadomość...\" nie może pozostać puste.",
    "send": "Wyślij",
    "sendMessage": "Wiadomość została wysłana !"
  },

  "footer": "Wszelkie prawa zastrzeżone."
}
